app/controllers/movies_controller.rb

  def index
    # :order filtered :movies by the param :sort from index.html.haml
    # Second iteration, filter by selected ratings on the index view, then order them by the selected params
    # @movies = Movie.find_all_by_rating(params[:ratings].present? : params[:ratings] ? session[:ratings])
    @movies = Movie.where(:rating => params[:ratings].keys) if params[:ratings].present?
---
SELECT "movies".* FROM "movies" WHERE "movies"."ratings" IS NULL AND "movies"."rating" IN ('PG-13', 'R')